export const DIAGNOSIS_DATA = [
  {
    label: "NI (攝取領域)",
    problems: {
      "體重過輕": {
        etiologies: [
          "對食物與營養相關知識缺乏", "熱量攝取不足", "熱量需求增加", "活動量過高",
          "有食物攝取禁忌或限制", "飲食失調", "環境經濟因素",
          "胎兒體位小於懷孕週期應有體重、於子宮內生長遲緩或受限、或每日體重增加不足"
        ],
        symptoms: [
          "BMI < 18.5 kg/m^2 (成人)", "皮下脂肪厚度、中臂肌肉圍減少", "體瘦、缺乏體脂肪",
          "肌肉變少", "攝取量小於建議量", "食物供應不足", "節食、不良的飲食流行時尚",
          "長期饑餓", "拒絕進食", "活動量大於建議量", "使用影響食欲的藥物",
          "營養不良，維生素、礦物質缺乏", "有疾病或身心障礙", "有精神障礙或失智疾病",
          "新陳代謝率過高", "舞蹈、體操等運動員", "照顧不當之幼兒", "有飲食偏好"
        ]
      },
      "體重過重/肥胖": {
        etiologies: ["對食物與營養相關知識缺乏", "熱量攝取過多", "熱量需求降低", "活動量過低", 
                     "不當的飲食生活型態、尚未準備好進行飲食或生活型態的改變", "遺傳或是疾病因素", 
                     "心理及生活壓力過", "飲食失調"],
        symptoms: ["休息代謝率 < 預估或評估值", "男性腰圍 >= 90公分；女性腰圍 >= 80公分", 
                   "男性體脂肪 >= 25%；女性體脂肪 >= 30%", "三頭肌皮下脂肪厚度增加", 
                   "小兒重高指數 > 各性別及年齡層標準值", "高油脂、高熱量食物及飲料過量", "熱量攝取大於建議量", 
                   "活動量過低", "新陳代謝率過低", "無法透過控制飲食與運動顯著減少過多體重", "代謝症候群", 
                   "罹患影響體重控制的疾病", "患有慢性疾病或身心障礙", "飲食偏好嚴重", "照顧不當之幼兒"]
      },
      "體重正常": {
        etiologies: ["無"],
        symptoms: ["18.5 <= BMI < 24 kg/m^2 (成人)", "小兒符合生長曲線建議範圍", "無水腫、脫水、腹水情況", 
                   "熱量攝取合乎建議量"]
      },
      "明顯/嚴重體重減輕": {
        etiologies: ["對食物與營養相關知識缺乏", "食物攝取不足(自行進食能力不足)", 
                     "食物攝取不足(經濟、文化、宗教等影響)", "食物攝取不足(給予老人或幼童食物受限)", 
                     "營養素需求增加(如：長期異化代謝疾病、手術、燒燙傷、創傷) ", "活動量過高", 
                     "疾病影響(神經疾病引起的吞嚥困難)", "疾病影響(癌症或急性疾病引起的消化不良或腹瀉)", 
                     "刻意減肥", "心理因素(沮喪或飲食失調)"],
        symptoms: ["明顯的體重減輕(一個月內 5%)", "嚴重的體重減輕(一個月內 > 5%)", "體瘦、缺乏體脂肪", 
                   "衣服變寬鬆", "未依飲食疾病需求調整攝食量", "攝食不足或餐次減少", "進食習慣改變", 
                   "後天免疫不全、COPD、髖骨或長骨骨折", "嚴重灼傷、感染、手術、創傷", "甲狀腺機能亢進、短腸症、癌症", 
                   "使用體重減輕相關治療（如抗憂鬱劑或癌症化療）"]
      },
      "輕度 蛋白質-熱量營養不良 (Mild PEM)": {
        etiologies: ["對食物與營養相關知識缺乏", "熱量攝取不足", "熱量需求增加", "腸胃道結構及功能改變", 
                     "有食物攝取禁忌或限制", "心理因素(沮喪或飲食失調)", "疾病影響", "環境經濟因素", 
                     "腹膜透析液中含有葡萄糖，使食慾降低", "因腹膜炎增加蛋白質流失"],
        symptoms: ["Alb：3.5-5.0 g/dL（成人）", "Alb < 4.0 g/dL, TC ≦ 150 mg/dL （透析患者）", 
                   "成人體重 75-90% IBW或 85-90% UBW", "透析體重 乾體重 BMI < 18.5 或六個月乾體重減輕 10%",
                   "小兒 BMI <各年齡層第 5 百分位", "小兒生長發育遲緩", "小兒同年齡標準身高的90-95 %（發育障礙）或同年齡標準體重的75-90 %（消瘦）", 
                   "體瘦", "傷口癒合不良", "攝取量小於建議量", "食物供應不足", "節食、不良的飲食流行時尚", "長期飢餓",
                   "食物禁忌或對食物缺乏興趣", "使用降低食慾的藥物者、過度飲酒", "HBV攝取低於蛋白質建議量50 %", "食物製備能力不足",
                   "營養不良，缺乏維生素、礦物質", "患病或身體殘障者" , "飢餓相關之營養不良，如：神經性厭食，食道狹窄、任何造成進食受限的原因" ,
                   "慢性病相關之營養不良，如：器官衰竭、惡性腫瘤、類風濕性疾病、腸胃道疾病、肌萎性肥胖、吸收不良症狀，及至少包括下列病原：DM、鬰血性心衰竭、慢性阻塞性肺炎" ,
                   "嚴重感染，如：敗血症、肺炎、腹膜炎、傷口感染、嚴重燒傷、創傷、閉鎖性頭部損傷、急性肺損傷、呼吸窘迫症候群、重大手術（急性疾病或損傷相關之營養不良）" , 
                   "患精神障礙或失智" , "新陳代謝速率過高" , 
                   "透析量不足（HD：Kt/V ＜ 1.2，PD：Kt/V ＜ 2.0）" , "照顧不當之幼兒" , "有飲食偏好或飲食偏好嚴重"]
      },
      "中度 蛋白質-熱量營養不良 (Moderate PEM)": {
        etiologies: ["對食物與營養相關知識缺乏", "熱量攝取不足", "熱量需求增加", "腸胃道結構及功能改變", 
                     "有食物攝取禁忌或限制", "心理因素(沮喪或飲食失調)"],
        symptoms: ["成人Alb：3.5-5.0 g/dL", "Alb < 4.0 g/dL, TC ≦ 150 mg/dL （透析患者）", 
                   "成人體重 60-75% IBW或 75-84% UBW","透析體重 乾體重 BMI < 18.5 或六個月乾體重減輕 10%",
                   "小兒 BMI <各年齡層第 5 百分位", "小兒生長發育遲緩", 
                   "小兒同年齡標準身高的 85-89 %（發育障礙）或同年齡標準體重的 60-74 %（消瘦)", "體瘦",
                   "傷口癒合不良", "皮下脂肪或肌肉消瘦", "攝取量小於建議量", "食物供應不足", "節食、不良的飲食流行時尚",
                   "長期飢餓", "食物禁忌或對食物缺乏興趣", "使用降低食慾的藥物者、過度飲酒", "HBV攝取低於蛋白質建議量50 %",
                   "食物製備能力不足", "營養不良，缺乏維生素、礦物質", "患病或身體殘障者",
                   "飢餓相關之營養不良，如：神經性厭食，食道狹窄、任何造成進食受限的原因",
                   "慢性病相關之營養不良，如：器官衰竭、惡性腫瘤、類風濕性疾病、腸胃道疾病、肌萎性肥胖、吸收不良症狀，及至少包括下列病原：DM、鬰血性心衰竭、慢性阻塞性肺炎",
                   "嚴重感染，如：敗血症、肺炎、腹膜炎、傷口感染、嚴重燒傷、創傷、閉鎖性頭部損傷、急性肺損傷、呼吸窘迫症候群、重大手術（急性疾病或損傷相關之營養不良）",
                   "患精神障礙或失智" , "新陳代謝速率過高" , "透析量不足（HD：Kt/V ＜ 1.2，PD：Kt/V ＜ 2.0）" , 
                   "照顧不當之幼兒" , "有飲食偏好或飲食偏好嚴重"]
      },
      "熱量攝取過多": {
        etiologies: ["沒有意願降低熱量攝取", "對食物與營養相關知識缺乏", "缺乏健康食物選擇的管道（如：由照顧者提供飲食）",
                     "缺乏行為改變的價值觀", "靜脈及腸道營養過度餵食", 
                     "未依生理代謝狀況調整熱量攝取（如：高代謝狀態康復後、傷口復原、手術或其他原因造成行動不便、生活型態改變或因老化代謝率下降）",
                     "心理因素或生活壓力過大", "促進食慾藥物，例如：類固醇、抗憂鬰症藥物"],
        symptoms: ["過度餵食，導致高血糖、高三酸甘油酯、肝功能異常、氮質血症", "RQ ＞ 1.0",
                   "男性體脂肪≧25%；女性體脂肪≧30%", "BMI ≧ 24 kg/m2", "體重增加", "孕婦體重增加量超過建議範圍",
                   "體胖", "呼吸速率增加", "攝取高熱量密度或加大份量食物或飲料", "體重過重或肥胖", "代謝症候群",
                   "憂鬱或精神焦慮", "使用的藥物治療引起食慾增加，如：類固醇藥物"]
      },
      "熱量攝取足夠": {
        etiologies: ["無"],
        symptoms: ["平均每天攝取的熱量合乎生理需求（包括活動量）"]
      },
      
      "熱量攝取不足": {
        etiologies: ["食物與營養相關知識缺乏", "熱量需要增加，或無法攝取足夠的熱量（如：懷孕、哺乳、長期的異化性疾病）", 
                     "無法獲得足夠的食物或熱量", "有食物攝取禁忌或限制（如：經濟、文化或宗教等因素影響）",
                     "口腔功能不良或吞嚥困難", "心理因素（如：沮喪或飲食失調）", "腹膜透析液含葡萄糖，使食慾降低"],
        symptoms: ["TC值降低（只適用於透析患者）", "體重減輕", "無法增加或維持理想體重", "口腔功能不良",
                   "熱量攝取量低於建議量（成人為75 %）", "飲食中限制、排除或疏忽高熱量密度的食物",
                   "食物禁忌或對食物缺乏興趣", "無法自行進食（如：手部、腕部或指頭關節功能變差）", 
                   "靜脈或腸道營養未提供足夠的熱量" , "酗酒或使用降低食慾的藥物", "缺乏製備飲食的能力" ,
                   "藥物影響食慾", "精神疾病、飲食失調、失智、酗酒、藥物濫用、短期或長期疼痛治療"]
      },
      "碳水化合物攝取過多": {
        etiologies: ["食物與營養相關知識缺乏", "熱量需要增加，或無法攝取足夠的熱量（如：長期的異化性疾病）", 
                     "有食物攝取禁忌或限制（如：經濟、文化或宗教等因素影響）", "口腔功能不良或吞嚥困難",
                     "心理因素（如：沮喪或飲食失調）", "不完全遵從醫師或營養師給予的食物及營養建議",
                     "個人飲食喜好之偏差", "生理的原因需調整碳水化合物攝取量（如：DM、乳糖酶缺乏、蔗糖酶-異麥芽糖酶缺乏、β醛糖酶缺乏）"],
        symptoms: ["TG ＞ 150 mg/ dL", "高血糖（AC ＞ 126 mg/dL）", "配對檢查，餐後比餐前增加血糖50-60mg/dL以上", 
                   "糖化血色素 ＞ 6 %", "OGTT結果異常（餐後2小時血糖 ＞ 200 mg/dL）", "蛀牙", "食物攝取不均衡",
                   "喜好高碳水化合物食物", "碳水化合物攝取量超過建議量(肥胖及DM： ＞ 65%建議熱量；高膽固醇、高TG： ＞ 60%建議熱量",
                   "蛋白質或脂肪類食物攝取比例不足" , "食物禁忌", "長期使用藥物引起高血糖（如：類固醇藥物）", 
                   "營養不良，缺乏維生素、礦物質" , "胰臟功能不全引起胰島素分泌減少", 
                   "高TG、DM、血糖異常、先天性碳水化合物代謝異常疾病、乳糖酶缺乏、嚴重感染、敗血症、肥胖等",
                   "經濟因素限制購買適當的食物" , "照顧不當之幼兒", "有飲食偏好"]
      },
        "碳水化合物攝取偏低": {
        etiologies: ["食物與營養相關知識缺乏", "食物攝取不足(自行進食能力不足；經濟、文化、宗教等影響；給予老年人或孩童食物受限)", 
                     "營養素需求增加(如：長期異化代謝疾病、手術、燒燙傷、創傷)", "不均衡的減重飲食",
                     "心理因素（如：沮喪或飲食失調）", "生理因素（如：活動量增加或代謝改變或吸收不良需要增加熱量攝取）"],
        symptoms: ["呼吸有酮體水果味", "碳水化合物攝取 ＜ 50 % 建議熱量", "碳水化合物攝取量低於建議量", 
                   "無法自行進食、無法獨力攝取食物或液體", 
                   "胰臟功能不全、肝臟疾病、麩質過敏腸病變、癲癇、碳水化合物吸收不良、低碳水化合物飲食、使用高脂肪飲食減重",
                   "照顧不當之幼兒*", "有飲食偏好或飲食偏好嚴重", "罹患慢性疾病或腸胃道疾病", "身心殘障",
                   "對外交通不便地區及偏遠地區住民" , "低教育水準"]
      },
      "精製糖攝取過多": {
        etiologies: ["食物與營養相關知識缺乏", "飲食文化或個人偏好", "心理因素（如：沮喪或飲食失調）"],
        symptoms: ["攝取精製糖的熱量 > 10% 每日建議熱量", "因經濟狀況而限制食物的攝取種類",
                   "碳水化合物攝取類別與建議不同", "對某些含碳水化合物食物有過敏反應", 
                   "體重過重、代謝症候群、DM、高TG、肝臟疾病", "長期使用易引起高血糖或增加食慾的藥物者，如：類固醇藥物",
                   "偏好甜食"]
      },
      "脂肪攝取過多": {
        etiologies: ["食物與營養相關知識缺乏", "口味、食慾或喜好改變", "缺乏健康飲食選擇管道", "缺乏行為改變的價值觀"],
        symptoms: ["TC ＞ 200 mg/dL；LDL-C ＞ 100 mg/dL； HDL-C ＜ 40 mg/dL；TG ＞ 150 mg/dL", 
                   "血清澱粉酶或脂解酶濃度增加", "肝功能指數上升、血清總膽色素濃度增加", "糞便含脂肪量 ＞ 7 克/24hr",
                   "腹瀉、痙攣抽筋、脂肪瀉、胃痛", "出現黃色瘤", "脂肪攝取 ＞ 35 % 建議熱量", 
                   "經常或大量攝取高脂肪食物", "製備食物經常增加油脂", "經常攝取飽和脂肪酸、反式脂肪酸、膽固醇",
                   "使用下列藥物，如：胰酵素或其他降血脂藥物", 
                   "高血脂症、纖維化囊腫、心絞痛、動脈粥狀硬化、肝膽胰等疾病、移植手術後等",
                   "家族史：高脂血症、動脈粥狀硬化、胰臟炎", "照顧不當之幼兒", "有飲食偏好"]
      },
      "脂肪攝取偏低": {
        etiologies: ["腸胃道結構或功能改變", "不適當的食物選擇(自行進食能力不足)", "不適當的食物選擇(經濟、文化、宗教等影響)",
                     "不適當的食物選擇(給予老年人或孩童食物受限)", "心理因素(如：沮喪或飲食失調)", "不當的靜脈營養支持"],
        symptoms: ["三烯酸/四烯酸 ＞ 0.2", "體重減輕", "生長情況不足或欠缺", 
                   "當EFA缺乏時會出現皮膚炎，如：粗糙、鱗狀皮膚、皮膚炎", 
                   "EFA攝取量占總熱量百分比 ＜ 10 %（靜脈營養需特別注意）", 
                   "脂肪攝取 ＜ 25 % 建議熱量 ( TG ＞ 500 mg/dL除外 )", "脂肪攝取量低於建議量", 
                   "長期嚴守極低油飲食", "愛滋病、結核病、神經性厭食症、術後敗血症或嚴重感染",
                   "腸切除伴隨嚴重脂肪吸收不良、胰臟功能不足、肝病伴隨脂肪瀉", "照顧不當之幼兒*", "有飲食偏好",
                   "身心殘障", "使用靜脈營養支持"]
      },
      "飽和脂肪酸攝取過多": {
        etiologies: ["食物與營養觀念不正確", "缺乏獲取健康飲食之管道", "個人飲食喜好之偏差", "外食、應酬頻率高"],
        symptoms: ["TC ＞ 200 mg/dL；LDL-C ＞ 100 mg/dL； HDL-C ＜ 40 mg/dL；TG ＞ 150 mg/dL", 
                   "飽和脂肪酸攝取 ＞ 7% 建議熱量", "過量食用富含飽和脂肪酸的油脂", "喜好富含飽和脂肪酸食物",
                   "習慣喝未去油高湯", "喜好糕餅西點類食品", "脂肪肝、冠心病、糖尿病", "照顧不當之幼", "有飲食偏好"]
      },
      "蛋白質攝取過多": {
        etiologies: ["對食物及營養議題有錯誤認知", "特殊蛋白質補充品使用不當", "趨附飲食流行時尚",
                     "因疾病因素而需降低蛋白質攝取量（代謝異常、肝功能異常、腎功能異常）", "欠缺行為改變動力"],
        symptoms: ["BUN增加，腎絲球過濾率降低", "小兒因代謝失調導致生長遲緩，BMI ＜ 各年齡層第5百分位",
                   "蛋白質攝取 > 20% 建議熱量", "蛋白質攝取 > 1.5g/Kg BW",
                   "慢性腎衰竭未透析者蛋白質攝取 > 0.8g/Kg BW”, “總蛋白質攝取量高於建議量，如：嚴重的肝昏迷、早期腎病",
                   "不適當的補充", "早期腎病或嚴重的肝昏迷", "照顧不當之幼兒*", "有飲食偏好"]
      },
      "蛋白質攝取偏低": {
        etiologies: ["食物與營養相關知識缺乏", "缺乏獲得食物管道(自行進食能力不足)",
                     "缺乏獲得食物管道(經濟、文化、宗教等影響)", "缺乏獲得食物管道(給予老年人或孩童食物受限)",
                     "生理因素（如：懷孕、哺乳、消耗性疾病增加營養素需求，吸收不良，年齡或健康狀況）",
                     "心理因素（如：沮喪或飲食失調）", "對疾病造成身體殘害認知不足", "欠缺行為改變動力",
                     "透析治療增加需求量", "腹膜透析液含葡萄糖，使食慾降低"],
        symptoms: ["水腫、生長遲緩、肌肉發育不良、膚色黯沈、毛髮稀薄且易損傷", "蛋白質攝取 <10% 建議熱量",
                   "蛋白質攝取 <0.8g/Kg BW", "透析患者攝取 <1.2g/Kg BW", "蛋白質攝取不足無法達到需要量",
                   "長期嚴守極低蛋白質減重飲食", "文化或宗教行為限制蛋白質攝取量", "經濟因素限制購買適當的食物", 
                   "嚴重蛋白質吸收不良，如：腸切除、慢性腹瀉、巨腸症、短腸症、腸切除、膽道阻塞等",
                   "對外交通不便地區及偏遠地區住民", "低教育水準"]
      },
        "高生理價蛋白質攝取不足": {
        etiologies: ["食物與營養相關知識缺乏", "對疾病影響認知不足", "欠缺行為改變動力", "文化或宗教影響(如素食)",
                     "心理因素（如：沮喪或飲食失調）", "懷孕第二期、第三期孕婦、哺乳婦", "因透析治療方式而增加蛋白質需求量",
                     "腹膜透析液含葡萄糖，使食慾降低"],
        symptoms: ["HBV攝取 <50% 蛋白質個人生理需求建議量"]
      },
      "膳食纖維質攝取過多": {
        etiologies: [
          "缺乏適當纖維攝取量的知識", "只準備或攝取高纖食物，而排除其他營養素豐富的食物",
          "食物及營養相關知識缺乏", "對食物及營養相關議題有錯誤認知及態度，例如：執著於排便次數與習慣"],
        symptoms: [
          "腹脹、腸蠕動異常、噁心、嘔吐、腸胃大量脹氣、腹瀉、腹部絞痛、糞便量大或次數頻繁",
          "纖維攝取量高於耐受量或建議量",
          "膳食纖維質攝取 > 14 g/1000Kcal",
          "消化性潰瘍、大腸激躁症、發炎性腸道疾病、短腸症、憩室炎、阻塞性便秘、脫痔、腸道狹窄、飲食障礙、妄想強迫症傾向、腸阻塞、糞石"
        ]
      },
      "水份攝取過多": {
        etiologies: [
          "照顧者或本身缺乏食物與營養相關知識",
          "生理因素（如：因肝、腎或心臟衰竭等疾病造成ADH作用異常，降低液體與鈉的排出、沮喪或飲食失調）",
          "對營養相關建議不瞭解或不遵循", "過量攝取水分、湯或飲料", "食物過度調味", "誤食或強迫餵食"
        ],
        symptoms: [
          "血漿滲透壓偏低（270-280 mOsm/kg），只有在鈉與水同時過量且水多於鈉時，才會液體正平衡",
          "抗利尿激素分泌不當症候群（SIADH）導致血鈉降低", "體重增加", "HD：二次透析間體重增加 > 5 %乾體重",
          "下肢皮膚、骶骨、瀰漫水腫、下肢滲出液體", "腹水", "肺積水", "噁心、嘔吐、厭食症、頭痛、肌肉痙攣、抽搐",
          "活動性或休息時呼吸短促或呼吸困難", "藉由大量液體給藥使用抑制水分排出藥物，如類固醇或荷爾蒙類藥物",
          "眼神呆滯", "神經反射增強", "尿量減少", "成人 水份攝取量大於建議量(1ml/kcal/d 或 35ml/kg/d 或 2.0~2.5L/d)",
          "新生兒 水份攝取量大於建議量(150~180ml/kg)", "小兒(1-10 kg) 水份攝取量大於建議量(100ml×kg)",
          "小兒(11-20 kg) 水份攝取量大於建議量(1000ml＋50ml×(體重-10))", "小兒(>20 kg) 水份攝取量大於建議量(1500ml＋20ml×(體重-20))",
          "HD (一日水分攝取 ＞ 前一日尿量+700 c.c 或 二次血液透析間體重增加 ＞ 5 % 乾體重", 
          "PD 水份攝取量大於建議量 (＞ 2000 c.c)", "鹽分攝取過多導致水份攝取過多", "無法耐受固體食物，以進食流質食物為主", 
          "末期腎臟病、腎病症候群、心臟衰竭、肝臟疾病", "昏迷(SIADH)", "照顧不當的幼兒"
        ]
      },
      "水分攝取不足": {
        etiologies: [
          "運動或發燒導致流失增加", "無法進食或進食受限(沒有能力自行喝水)", "高溫乾燥環境下長時間工作",
          "口渴敏感度降低", "照顧者或本身缺乏食物與營養相關知識", "心理因素（如：沮喪或飲食失調）", 
          "認知能力障礙，包括：學習障礙、神經或感覺障礙、失智", "短腸症、慢性腹瀉、急慢性腸胃炎導致水分吸收減少",
          "攝取量減少，但排泄量卻增加"
        ],
        symptoms: [
          "血漿或血清滲透壓 > 290 mOsm/kg", "血清：BUN增加，血清鈉增加", "成人排尿量 < 30 mL/hr",
          "小兒尿液排出減少", "急性體重減輕", "皮膚與黏膜乾燥，皮膚無彈性", "吞嚥困難", 
          "口渴", "成人 水份攝取量大於建議量(1ml/kcal/d 或 35ml/kg/d 或 2.0~2.5L/d)", 
          "新生兒 水份攝取量大於建議量(150~180ml/kg)", "小兒 水份攝取量大於建議量(1-10 kg：100ml×kg)", 
          "小兒 水份攝取量大於建議量(11-20kg：1000ml＋50ml×(體重-10))", 
          "小兒 水份攝取量大於建議量(小兒 ＞20 kg：1500ml＋20ml×(體重-20))", 
          "阿茲海默症或失智、腹瀉等急慢性腸胃道疾病", "照顧不當的幼兒", "水份攝取量少於生理需求建議量"
        ]
      },
      "其他": {
        etiologies: ["其他"],
        symptoms: ["其他"]
      }
    }
  },
  NC: {
    label: "NC (臨床領域)",
    problems: {
      "吞嚥困難": {
        etiologies: ["發炎、手術、狹窄","口腔、咽喉、食道腫瘤及其外科手術治療、放射治療", "使用呼吸器", "肌肉運動因素", "改變吸吮、吞嚥、呼吸型態", "頸、頭部手術"],
        symptoms: ["吞嚥測試不正常","咀嚼或吞嚥時出現過多的口腔動作", "進餐中常出現咳嗽或嗆咳", "每口食物需嚥兩三回才能夠吞乾淨", "用餐過程有流涎的現象", "用餐後舌面或口腔內一側有食物堆積而不自覺", "喝水過後咽喉處發出咕嚕聲", "脫水或營養不良", "進食時間延長", "食物攝取量降低", "拒絕進食", "反覆上呼吸道感染或肺炎"]
      },
      "咀嚼困難": {
        etiologies: ["顱面畸形","面骨裂損", "口腔、牙科、面部手術", "神經肌肉功能異常", "缺牙或無牙", "全身性疾病之原發或口腔表徵之軟組織疾病", "口乾症"],
        symptoms: ["缺牙或無牙","腦神經功能改變", "口乾", "口腔病變影響進食能力", "舌運動障礙", "不合適或破損的假牙", "食物攝取量減少", "不食用不易形成食糰的食物", "不食用適齡質地的食物", "吐出食物或進食時間延長", "酗酒", "阿茲海默症", "頭頸癌、腦性麻痺", "唇顎裂、口腔軟組織感染", "化療伴隨之口腔副作用", "口腔放射線治療"]
      },
      "腸胃道功能改變": {
        etiologies: ["腸胃道結構及功能改變","腸胃道運動功能改變", "胰臟、肝臟功能受損", "正常功能之腸胃道長度變短"],
        symptoms: ["消化酵素及糞便脂肪試驗結果異常", "內視鏡或大腸鏡觀察結果", "貧血", "明顯的體重減輕", "脹氣", "厭食、噁心、嘔吐、腹瀉、脂肪瀉", "便秘、腹痛", "傾食症候群、胃炎", "腸胃道外科手術後"]
      },
      "生化數值改變": {
        etiologies: ["疾病狀態影響", "藥物副作用", "不當的營養素攝取"],
        symptoms: ["AC 血糖異常", "HbA1c 偏高", "血脂異常"]
      },
      "其他": {
        etiologies: ["其他"],
        symptoms: ["其他"]
      }
    }
  },
  NB: {
    label: "NB (行為環境領域)",
    problems: {
      "食物與營養相關知識缺乏": {
        etiologies: ["從未接受衛教", "錯誤資訊來源", "認知能力受限"],
        symptoms: ["無法正確辨識食物種類", "飲食習慣不符疾病需求", "錯誤執行治療餐次"]
      },
      "其他": {
        etiologies: ["其他"],
        symptoms: ["其他"]
      }
    }
  }
};
