export const DIET_GUIDELINES: { [type: string]: GuidelineData } = {
  'DM': {
    '1200': { '低脂乳品類': 1.5, '全榖雜糧類': 7.5, '中脂豆魚蛋肉類': 2, '蔬菜類': 3, '水果類': 2, '油脂與堅果類': 2.5 },
    '1300': { '低脂乳品類': 1.5, '全榖雜糧類': 8.5, '中脂豆魚蛋肉類': 2, '蔬菜類': 3, '水果類': 2, '油脂與堅果類': 4 },
    '1400': { '低脂乳品類': 1.5, '全榖雜糧類': 9.5, '中脂豆魚蛋肉類': 2.5, '蔬菜類': 3, '水果類': 2, '油脂與堅果類': 4 },
    '1500': { '低脂乳品類': 1.5, '全榖雜糧類': 10, '中脂豆魚蛋肉類': 3, '蔬菜類': 4, '水果類': 2, '油脂與堅果類': 4 },
    '1600': { '低脂乳品類': 1.5, '全榖雜糧類': 11, '低脂豆魚蛋肉類': 1, '中脂豆魚蛋肉類': 2.5, '蔬菜類': 4, '水果類': 2, '油脂與堅果類': 4.5 },
    '1800': { '低脂乳品類': 1.5, '全榖雜糧類': 12, '中脂豆魚蛋肉類': 3.5, '蔬菜類': 4, '水果類': 3, '油脂與堅果類': 5 },
    '2000': { '低脂乳品類': 1.5, '全榖雜糧類': 14, '中脂豆魚蛋肉類': 4, '蔬菜類': 5, '水果類': 3, '油脂與堅果類': 5.5 },
    '2200': { '低脂乳品類': 1.5, '全榖雜糧類': 15, '中脂豆魚蛋肉類': 5, '蔬菜類': 6, '水果類': 3, '油脂與堅果類': 6 }
  },
  'CKD': {
    '1500': { '全榖雜糧類': 8, '低氮澱粉': 3.5, '中脂豆魚蛋肉類': 3, '蔬菜類': 3, '水果類': 2, '油脂與堅果類': 7 },
    '1650': { '全榖雜糧類': 9, '低氮澱粉': 4.5, '中脂豆魚蛋肉類': 3, '蔬菜類': 3, '水果類': 2, '油脂與堅果類': 6.5 },
    '1800': { '全榖雜糧類': 10, '低氮澱粉': 5, '中脂豆魚蛋肉類': 3.5, '蔬菜類': 3, '水果類': 2, '油脂與堅果類': 8 },
    '1950': { '全榖雜糧類': 10, '低氮澱粉': 7, '低脂豆魚蛋肉類': 1, '中脂豆魚蛋肉類': 3, '蔬菜類': 3.5, '水果類': 2, '油脂與堅果類': 8 },
    '2100': { '全榖雜糧類': 10, '低氮澱粉': 8, '低脂豆魚蛋肉類': 1.5, '中脂豆魚蛋肉類': 3, '蔬菜類': 3.5, '水果類': 2, '油脂與堅果類': 9 },
    '2250': { '全榖雜糧類': 10.5, '低氮澱粉': 9.5, '低脂豆魚蛋肉類': 1, '中脂豆魚蛋肉類': 4, '蔬菜類': 3.5, '水果類': 2.5, '油脂與堅果類': 8 },
    '2400': { '全榖雜糧類': 12, '低氮澱粉': 9.5, '中脂豆魚蛋肉類': 5, '蔬菜類': 4, '水果類': 2.5, '油脂與堅果類': 8 },
    '2550': { '全榖雜糧類': 12, '低氮澱粉': 10.5, '低脂豆魚蛋肉類': 0.5, '中脂豆魚蛋肉類': 5, '蔬菜類': 4, '水果類': 3, '油脂與堅果類': 8.5 },
    '2700': { '全榖雜糧類': 13, '低氮澱粉': 11, '低脂豆魚蛋肉類': 1, '中脂豆魚蛋肉類': 5, '蔬菜類': 5, '水果類': 3, '油脂與堅果類': 9 }
  }
};

export const EDUCATION_TOPICS = [
  "糖尿病飲食原則",
  "腎臟病飲食原則",
  "高血壓飲食原則",
  "高血脂飲食原則",
  "痛風飲食原則",
  "體重控制原則",
  "均衡飲食原則",
  "食物份量代換",
  "外食選擇技巧",
  "營養標示閱讀"
];
